
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>三、单元测试 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="styles/website.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="安全规约.html" />
    
    
    <link rel="prev" href="异常日志/其他.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    一、编程规约
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="编程规约/命名风格.html">
            
                <a href="编程规约/命名风格.html">
            
                    
                    （一）命名风格
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="编程规约/常量定义.html">
            
                <a href="编程规约/常量定义.html">
            
                    
                    （二）常量定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="编程规约/代码格式.html">
            
                <a href="编程规约/代码格式.html">
            
                    
                    （三）代码格式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="编程规约/OOP规范.html">
            
                <a href="编程规约/OOP规范.html">
            
                    
                    （四）OOP规范
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="编程规约/集合处理.html">
            
                <a href="编程规约/集合处理.html">
            
                    
                    （五）集合处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="编程规约/并发处理.html">
            
                <a href="编程规约/并发处理.html">
            
                    
                    （六）并发处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="编程规约/控制语句.html">
            
                <a href="编程规约/控制语句.html">
            
                    
                    （七）控制语句
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="编程规约/注释规约.html">
            
                <a href="编程规约/注释规约.html">
            
                    
                    （八）注释规约
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    二、异常日志
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="异常日志/异常处理.html">
            
                <a href="异常日志/异常处理.html">
            
                    
                    （一）异常处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="异常日志/日志规约.html">
            
                <a href="异常日志/日志规约.html">
            
                    
                    （二）日志规范
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="异常日志/其他.html">
            
                <a href="异常日志/其他.html">
            
                    
                    （三）其他
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="单元测试.html">
            
                <a href="单元测试.html">
            
                    
                    三、单元测试
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="安全规约.html">
            
                <a href="安全规约.html">
            
                    
                    四、安全规约
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    五、MySQL数据库
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="MySQL数据库/建表规约.html">
            
                <a href="MySQL数据库/建表规约.html">
            
                    
                    （一）建表规约
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="MySQL数据库/索引规约.html">
            
                <a href="MySQL数据库/索引规约.html">
            
                    
                    （二）索引规约
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.3" data-path="MySQL数据库/SQL语句.html">
            
                <a href="MySQL数据库/SQL语句.html">
            
                    
                    （三）SQL语句
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.4" data-path="MySQL数据库/ORM映射.html">
            
                <a href="MySQL数据库/ORM映射.html">
            
                    
                    （四）ORM映射
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" >
            
                <span>
            
                    
                    六、工程结构
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="工程结构/应用分层.html">
            
                <a href="工程结构/应用分层.html">
            
                    
                    （一）应用分层
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.2" data-path="工程结构/二方库依赖.html">
            
                <a href="工程结构/二方库依赖.html">
            
                    
                    （二）二方库依赖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.3" data-path="工程结构/服务器.html">
            
                <a href="工程结构/服务器.html">
            
                    
                    （三）服务器
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="版本历史.html">
            
                <a href="版本历史.html">
            
                    
                    附1：版本历史 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="本手册专有名词.html">
            
                <a href="本手册专有名词.html">
            
                    
                    附2：本手册专有名词 
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >三、单元测试</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x4E09;&#x3001;&#x5355;&#x5143;&#x6D4B;&#x8BD5;">&#x4E09;&#x3001;&#x5355;&#x5143;&#x6D4B;&#x8BD5;</h2>
<ol>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x597D;&#x7684;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x5FC5;&#x987B;&#x9075;&#x5B88;AIR&#x539F;&#x5219;&#x3002; 
<br><span style="color:orange">&#x8BF4;&#x660E;</span>&#xFF1A;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x5728;&#x7EBF;&#x4E0A;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x611F;&#x89C9;&#x50CF;&#x7A7A;&#x6C14;&#xFF08;AIR&#xFF09;&#x4E00;&#x6837;&#x5E76;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x4F46;&#x5728;&#x6D4B;&#x8BD5;&#x8D28;&#x91CF;&#x7684;&#x4FDD;&#x969C;&#x4E0A;&#xFF0C;&#x5374;&#x662F;&#x975E;&#x5E38;&#x5173;&#x952E;&#x7684;&#x3002;&#x597D;&#x7684;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x5B8F;&#x89C2;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x5177;&#x6709;&#x81EA;&#x52A8;&#x5316;&#x3001;&#x72EC;&#x7ACB;&#x6027;&#x3001;&#x53EF;&#x91CD;&#x590D;&#x6267;&#x884C;&#x7684;&#x7279;&#x70B9;&#x3002; <ul>
<li>A&#xFF1A;Automatic&#xFF08;&#x81EA;&#x52A8;&#x5316;&#xFF09; </li>
<li>I&#xFF1A;Independent&#xFF08;&#x72EC;&#x7ACB;&#x6027;&#xFF09; </li>
<li>R&#xFF1A;Repeatable&#xFF08;&#x53EF;&#x91CD;&#x590D;&#xFF09; </li>
</ul>
</li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x5E94;&#x8BE5;&#x662F;&#x5168;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x975E;&#x4EA4;&#x4E92;&#x5F0F;&#x7684;&#x3002;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x901A;&#x5E38;&#x662F;&#x88AB;&#x5B9A;&#x671F;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x5FC5;&#x987B;&#x5B8C;&#x5168;&#x81EA;&#x52A8;&#x5316;&#x624D;&#x6709;&#x610F;&#x4E49;&#x3002;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x9700;&#x8981;&#x4EBA;&#x5DE5;&#x68C0;&#x67E5;&#x7684;&#x6D4B;&#x8BD5;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3002;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x4E2D;&#x4E0D;&#x51C6;&#x4F7F;&#x7528;System.out&#x6765;&#x8FDB;&#x884C;&#x4EBA;&#x8089;&#x9A8C;&#x8BC1;&#xFF0C;&#x5FC5;&#x987B;&#x4F7F;&#x7528;assert&#x6765;&#x9A8C;&#x8BC1;&#x3002; </li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x4FDD;&#x6301;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7684;&#x72EC;&#x7ACB;&#x6027;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7A33;&#x5B9A;&#x53EF;&#x9760;&#x4E14;&#x4FBF;&#x4E8E;&#x7EF4;&#x62A4;&#xFF0C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x4E4B;&#x95F4;&#x51B3;&#x4E0D;&#x80FD;&#x4E92;&#x76F8;&#x8C03;&#x7528;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x4F9D;&#x8D56;&#x6267;&#x884C;&#x7684;&#x5148;&#x540E;&#x6B21;&#x5E8F;&#x3002; <br><span style="color:red">&#x53CD;&#x4F8B;</span>&#xFF1A;method2&#x9700;&#x8981;&#x4F9D;&#x8D56;method1&#x7684;&#x6267;&#x884C;&#xFF0C;&#x5C06;&#x6267;&#x884C;&#x7ED3;&#x679C;&#x4F5C;&#x4E3A;method2&#x7684;&#x8F93;&#x5165;&#x3002; </li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x662F;&#x53EF;&#x4EE5;&#x91CD;&#x590D;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x4E0D;&#x80FD;&#x53D7;&#x5230;&#x5916;&#x754C;&#x73AF;&#x5883;&#x7684;&#x5F71;&#x54CD;&#x3002; 
<br><span style="color:orange">&#x8BF4;&#x660E;</span>&#xFF1A;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x901A;&#x5E38;&#x4F1A;&#x88AB;&#x653E;&#x5230;&#x6301;&#x7EED;&#x96C6;&#x6210;&#x4E2D;&#xFF0C;&#x6BCF;&#x6B21;&#x6709;&#x4EE3;&#x7801;check in&#x65F6;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x90FD;&#x4F1A;&#x88AB;&#x6267;&#x884C;&#x3002;&#x5982;&#x679C;&#x5355;&#x6D4B;&#x5BF9;&#x5916;&#x90E8;&#x73AF;&#x5883;&#xFF08;&#x7F51;&#x7EDC;&#x3001;&#x670D;&#x52A1;&#x3001;&#x4E2D;&#x95F4;&#x4EF6;&#x7B49;&#xFF09;&#x6709;&#x4F9D;&#x8D56;&#xFF0C;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x6301;&#x7EED;&#x96C6;&#x6210;&#x673A;&#x5236;&#x7684;&#x4E0D;&#x53EF;&#x7528;&#x3002; <br><span style="color:green">&#x6B63;&#x4F8B;</span>&#xFF1A;&#x4E3A;&#x4E86;&#x4E0D;&#x53D7;&#x5916;&#x754C;&#x73AF;&#x5883;&#x5F71;&#x54CD;&#xFF0C;&#x8981;&#x6C42;&#x8BBE;&#x8BA1;&#x4EE3;&#x7801;&#x65F6;&#x5C31;&#x628A;SUT&#x7684;&#x4F9D;&#x8D56;&#x6539;&#x6210;&#x6CE8;&#x5165;&#xFF0C;&#x5728;&#x6D4B;&#x8BD5;&#x65F6;&#x7528;spring &#x8FD9;&#x6837;&#x7684;DI&#x6846;&#x67B6;&#x6CE8;&#x5165;&#x4E00;&#x4E2A;&#x672C;&#x5730;&#xFF08;&#x5185;&#x5B58;&#xFF09;&#x5B9E;&#x73B0;&#x6216;&#x8005;Mock&#x5B9E;&#x73B0;&#x3002; </li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x5BF9;&#x4E8E;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF0C;&#x8981;&#x4FDD;&#x8BC1;&#x6D4B;&#x8BD5;&#x7C92;&#x5EA6;&#x8DB3;&#x591F;&#x5C0F;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x7CBE;&#x786E;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#x3002;&#x5355;&#x6D4B;&#x7C92;&#x5EA6;&#x81F3;&#x591A;&#x662F;&#x7C7B;&#x7EA7;&#x522B;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x65B9;&#x6CD5;&#x7EA7;&#x522B;&#x3002; 
<br><span style="color:orange">&#x8BF4;&#x660E;</span>&#xFF1A;&#x53EA;&#x6709;&#x6D4B;&#x8BD5;&#x7C92;&#x5EA6;&#x5C0F;&#x624D;&#x80FD;&#x5728;&#x51FA;&#x9519;&#x65F6;&#x5C3D;&#x5FEB;&#x5B9A;&#x4F4D;&#x5230;&#x51FA;&#x9519;&#x4F4D;&#x7F6E;&#x3002;&#x5355;&#x6D4B;&#x4E0D;&#x8D1F;&#x8D23;&#x68C0;&#x67E5;&#x8DE8;&#x7C7B;&#x6216;&#x8005;&#x8DE8;&#x7CFB;&#x7EDF;&#x7684;&#x4EA4;&#x4E92;&#x903B;&#x8F91;&#xFF0C;&#x90A3;&#x662F;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x7684;&#x9886;&#x57DF;&#x3002; </li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x3001;&#x6838;&#x5FC3;&#x5E94;&#x7528;&#x3001;&#x6838;&#x5FC3;&#x6A21;&#x5757;&#x7684;&#x589E;&#x91CF;&#x4EE3;&#x7801;&#x786E;&#x4FDD;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x901A;&#x8FC7;&#x3002; 
<br><span style="color:orange">&#x8BF4;&#x660E;</span>&#xFF1A;&#x65B0;&#x589E;&#x4EE3;&#x7801;&#x53CA;&#x65F6;&#x8865;&#x5145;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF0C;&#x5982;&#x679C;&#x65B0;&#x589E;&#x4EE3;&#x7801;&#x5F71;&#x54CD;&#x4E86;&#x539F;&#x6709;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF0C;&#x8BF7;&#x53CA;&#x65F6;&#x4FEE;&#x6B63;&#x3002; </li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x5FC5;&#x987B;&#x5199;&#x5728;&#x5982;&#x4E0B;&#x5DE5;&#x7A0B;&#x76EE;&#x5F55;&#xFF1A;src/test/java&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x5199;&#x5728;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x76EE;&#x5F55;&#x4E0B;&#x3002; 
<br><span style="color:orange">&#x8BF4;&#x660E;</span>&#xFF1A;&#x6E90;&#x7801;&#x6784;&#x5EFA;&#x65F6;&#x4F1A;&#x8DF3;&#x8FC7;&#x6B64;&#x76EE;&#x5F55;&#xFF0C;&#x800C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x6846;&#x67B6;&#x9ED8;&#x8BA4;&#x662F;&#x626B;&#x63CF;&#x6B64;&#x76EE;&#x5F55;&#x3002; </li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7684;&#x57FA;&#x672C;&#x76EE;&#x6807;&#xFF1A;&#x8BED;&#x53E5;&#x8986;&#x76D6;&#x7387;&#x8FBE;&#x5230;70%&#xFF1B;&#x6838;&#x5FC3;&#x6A21;&#x5757;&#x7684;&#x8BED;&#x53E5;&#x8986;&#x76D6;&#x7387;&#x548C;&#x5206;&#x652F;&#x8986;&#x76D6;&#x7387;&#x90FD;&#x8981;&#x8FBE;&#x5230;100% 
<br><span style="color:orange">&#x8BF4;&#x660E;</span>&#xFF1A;&#x5728;&#x5DE5;&#x7A0B;&#x89C4;&#x7EA6;&#x7684;&#x5E94;&#x7528;&#x5206;&#x5C42;&#x4E2D;&#x63D0;&#x5230;&#x7684;DAO&#x5C42;&#xFF0C;Manager&#x5C42;&#xFF0C;&#x53EF;&#x91CD;&#x7528;&#x5EA6;&#x9AD8;&#x7684;Service&#xFF0C;&#x90FD;&#x5E94;&#x8BE5;&#x8FDB;&#x884C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3002;   </li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x7F16;&#x5199;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x9075;&#x5B88;BCDE&#x539F;&#x5219;&#xFF0C;&#x4EE5;&#x4FDD;&#x8BC1;&#x88AB;&#x6D4B;&#x8BD5;&#x6A21;&#x5757;&#x7684;&#x4EA4;&#x4ED8;&#x8D28;&#x91CF;&#x3002; <ul>
<li>B&#xFF1A;Border&#xFF0C;&#x8FB9;&#x754C;&#x503C;&#x6D4B;&#x8BD5;&#xFF0C;&#x5305;&#x62EC;&#x5FAA;&#x73AF;&#x8FB9;&#x754C;&#x3001;&#x7279;&#x6B8A;&#x53D6;&#x503C;&#x3001;&#x7279;&#x6B8A;&#x65F6;&#x95F4;&#x70B9;&#x3001;&#x6570;&#x636E;&#x987A;&#x5E8F;&#x7B49;&#x3002; </li>
<li>C&#xFF1A;Correct&#xFF0C;&#x6B63;&#x786E;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x5E76;&#x5F97;&#x5230;&#x9884;&#x671F;&#x7684;&#x7ED3;&#x679C;&#x3002; </li>
<li>D&#xFF1A;Design&#xFF0C;&#x4E0E;&#x8BBE;&#x8BA1;&#x6587;&#x6863;&#x76F8;&#x7ED3;&#x5408;&#xFF0C;&#x6765;&#x7F16;&#x5199;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3002; </li>
<li>E&#xFF1A;Error&#xFF0C;&#x5F3A;&#x5236;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x8F93;&#x5165;&#xFF08;&#x5982;&#xFF1A;&#x975E;&#x6CD5;&#x6570;&#x636E;&#x3001;&#x5F02;&#x5E38;&#x6D41;&#x7A0B;&#x3001;&#x975E;&#x4E1A;&#x52A1;&#x5141;&#x8BB8;&#x8F93;&#x5165;&#x7B49;&#xFF09;&#xFF0C;&#x5E76;&#x5F97;&#x5230;&#x9884;&#x671F;&#x7684;&#x7ED3;&#x679C;&#x3002; </li>
</ul>
</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x76F8;&#x5173;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x66F4;&#x65B0;&#xFF0C;&#x5220;&#x9664;&#x7B49;&#x64CD;&#x4F5C;&#xFF0C;&#x4E0D;&#x80FD;&#x5047;&#x8BBE;&#x6570;&#x636E;&#x5E93;&#x91CC;&#x7684;&#x6570;&#x636E;&#x662F;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x5E93;&#x628A;&#x6570;&#x636E;&#x63D2;&#x5165;&#x8FDB;&#x53BB;&#xFF0C;&#x8BF7;&#x4F7F;&#x7528;&#x7A0B;&#x5E8F;&#x63D2;&#x5165;&#x6216;&#x8005;&#x5BFC;&#x5165;&#x6570;&#x636E;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x51C6;&#x5907;&#x6570;&#x636E;&#x3002; <br><span style="color:red">&#x53CD;&#x4F8B;</span>&#xFF1A;&#x5220;&#x9664;&#x67D0;&#x4E00;&#x884C;&#x6570;&#x636E;&#x7684;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x5148;&#x76F4;&#x63A5;&#x624B;&#x52A8;&#x589E;&#x52A0;&#x4E00;&#x884C;&#x4F5C;&#x4E3A;&#x5220;&#x9664;&#x76EE;&#x6807;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E00;&#x884C;&#x65B0;&#x589E;&#x6570;&#x636E;&#x5E76;&#x4E0D;&#x7B26;&#x5408;&#x4E1A;&#x52A1;&#x63D2;&#x5165;&#x89C4;&#x5219;&#xFF0C;&#x5BFC;&#x81F4;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x5F02;&#x5E38;&#x3002; </li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x548C;&#x6570;&#x636E;&#x5E93;&#x76F8;&#x5173;&#x7684;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF0C;&#x53EF;&#x4EE5;&#x8BBE;&#x5B9A;&#x81EA;&#x52A8;&#x56DE;&#x6EDA;&#x673A;&#x5236;&#xFF0C;&#x4E0D;&#x7ED9;&#x6570;&#x636E;&#x5E93;&#x9020;&#x6210;&#x810F;&#x6570;&#x636E;&#x3002;&#x6216;&#x8005;&#x5BF9;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x4EA7;&#x751F;&#x7684;&#x6570;&#x636E;&#x6709;&#x660E;&#x786E;&#x7684;&#x524D;&#x540E;&#x7F00;&#x6807;&#x8BC6;&#x3002; <br><span style="color:green">&#x6B63;&#x4F8B;</span>&#xFF1A;&#x5728;RDC&#x5185;&#x90E8;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;RDC<em>UNIT_TEST</em>&#x7684;&#x524D;&#x7F00;&#x6807;&#x8BC6;&#x6570;&#x636E;&#x3002; </li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x5BF9;&#x4E8E;&#x4E0D;&#x53EF;&#x6D4B;&#x7684;&#x4EE3;&#x7801;&#x5EFA;&#x8BAE;&#x505A;&#x5FC5;&#x8981;&#x7684;&#x91CD;&#x6784;&#xFF0C;&#x4F7F;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x53EF;&#x6D4B;&#xFF0C;&#x907F;&#x514D;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x6D4B;&#x8BD5;&#x8981;&#x6C42;&#x800C;&#x4E66;&#x5199;&#x4E0D;&#x89C4;&#x8303;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x3002; </li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x5728;&#x8BBE;&#x8BA1;&#x8BC4;&#x5BA1;&#x9636;&#x6BB5;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x9700;&#x8981;&#x548C;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x4E00;&#x8D77;&#x786E;&#x5B9A;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x8303;&#x56F4;&#xFF0C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x6700;&#x597D;&#x8986;&#x76D6;&#x6240;&#x6709;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#xFF08;UC&#xFF09;&#x3002; </li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x8D28;&#x91CF;&#x4FDD;&#x969C;&#x624B;&#x6BB5;&#xFF0C;&#x4E0D;&#x5EFA;&#x8BAE;&#x9879;&#x76EE;&#x53D1;&#x5E03;&#x540E;&#x8865;&#x5145;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#xFF0C;&#x5EFA;&#x8BAE;&#x5728;&#x9879;&#x76EE;&#x63D0;&#x6D4B;&#x524D;&#x5B8C;&#x6210;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3002; </li>
<li>&#x3010;&#x53C2;&#x8003;&#x3011;&#x4E3A;&#x4E86;&#x66F4;&#x65B9;&#x4FBF;&#x5730;&#x8FDB;&#x884C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF0C;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x5E94;&#x907F;&#x514D;&#x4EE5;&#x4E0B;&#x60C5;&#x51B5;&#xFF1A;<ul>
<li>&#x6784;&#x9020;&#x65B9;&#x6CD5;&#x4E2D;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x8FC7;&#x591A;&#x3002; </li>
<li>&#x5B58;&#x5728;&#x8FC7;&#x591A;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x548C;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x3002; </li>
<li>&#x5B58;&#x5728;&#x8FC7;&#x591A;&#x7684;&#x5916;&#x90E8;&#x4F9D;&#x8D56;&#x3002; </li>
<li>&#x5B58;&#x5728;&#x8FC7;&#x591A;&#x7684;&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#x3002; 
<br><span style="color:orange">&#x8BF4;&#x660E;</span>&#xFF1A;&#x591A;&#x5C42;&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x536B;&#x8BED;&#x53E5;&#x3001;&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#x3001;&#x72B6;&#x6001;&#x6A21;&#x5F0F;&#x7B49;&#x65B9;&#x5F0F;&#x91CD;&#x6784;&#x3002; </li>
</ul>
</li>
<li>&#x3010;&#x53C2;&#x8003;&#x3011;&#x4E0D;&#x8981;&#x5BF9;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x5B58;&#x5728;&#x5982;&#x4E0B;&#x8BEF;&#x89E3;&#xFF1A; <ul>
<li>&#x90A3;&#x662F;&#x6D4B;&#x8BD5;&#x540C;&#x5B66;&#x5E72;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x672C;&#x6587;&#x662F;&#x5F00;&#x53D1;&#x624B;&#x518C;&#xFF0C;&#x51E1;&#x662F;&#x672C;&#x6587;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x4E0E;&#x5F00;&#x53D1;&#x540C;&#x5B66;&#x5F3A;&#x76F8;&#x5173;&#x7684;&#x3002;</li>
<li>&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x662F;&#x591A;&#x4F59;&#x7684;&#x3002;&#x6C7D;&#x8F66;&#x7684;&#x6574;&#x4F53;&#x529F;&#x80FD;&#x4E0E;&#x5404;&#x5355;&#x5143;&#x90E8;&#x4EF6;&#x7684;&#x6D4B;&#x8BD5;&#x6B63;&#x5E38;&#x4E0E;&#x5426;&#x662F;&#x5F3A;&#x76F8;&#x5173;&#x7684;&#x3002; </li>
<li>&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x4E0D;&#x9700;&#x8981;&#x7EF4;&#x62A4;&#x3002;&#x4E00;&#x5E74;&#x534A;&#x8F7D;&#x540E;&#xFF0C;&#x90A3;&#x4E48;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x51E0;&#x4E4E;&#x5904;&#x4E8E;&#x5E9F;&#x5F03;&#x72B6;&#x6001;&#x3002; </li>
<li>&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x4E0E;&#x7EBF;&#x4E0A;&#x6545;&#x969C;&#x6CA1;&#x6709;&#x8FA9;&#x8BC1;&#x5173;&#x7CFB;&#x3002;&#x597D;&#x7684;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x80FD;&#x591F;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x89C4;&#x907F;&#x7EBF;&#x4E0A;&#x6545;&#x969C;&#x3002; </li>
</ul>
</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="异常日志/其他.html" class="navigation navigation-prev " aria-label="Previous page: （三）其他">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="安全规约.html" class="navigation navigation-next " aria-label="Next page: 四、安全规约">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"三、单元测试","level":"1.4","depth":1,"next":{"title":"四、安全规约","level":"1.5","depth":1,"path":"安全规约.md","ref":"安全规约.md","articles":[]},"previous":{"title":"（三）其他","level":"1.3.3","depth":2,"path":"异常日志/其他.md","ref":"异常日志/其他.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["book-summary-scroll-position-saver","github","prism","-sharing","-highlight"],"pluginsConfig":{"github":{"url":"https://github.com/alibaba/p3c"},"book-summary-scroll-position-saver":{},"prism":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css"}},"file":{"path":"单元测试.md","mtime":"2018-01-13T07:52:52.584Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-01-15T14:41:43.583Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-book-summary-scroll-position-saver/book-summary-scroll-position-saver.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

